/*******************************************************************************
** 文件名称 : ds1302.h
** 当前版本 : 1.0
** 编译环境 : RealView MDK-ARM 4.20
** 文件描述 : 	
** 功能说明 : 在该文件中包含了所有需要使用的头文件
**
**                       (c) Copyright 2007-2012, viewtool
**                            http://www.viewtool.com
**                               All Rights Reserved
**
*******************************************************************************/
/* 防止重复定义-----------------------------------------------------------------*/
#ifndef _DS1302_H
#define _DS1302_H
/* 包含头文件 *****************************************************************/
#include <stm32f10x.h>

/* 宏定义 ------------------------------------------------------------------*/
/* 引脚定义 --------------------------------------------------------------------*/ 
#define ds1302clk GPIO_Pin_8
#define ds1302dat GPIO_Pin_7
#define ds1302rst GPIO_Pin_6    

#define ds1302gpio GPIOC  
/* 变量 ----------------------------------------------------------------------*/
/* 函数声明 ------------------------------------------------------------------*/
/* 函数定义 ------------------------------------------------------------------*/

void ds1302_GPIO_Configuration(void);
void write_1302byte(uint8_t dat);				 //写一个字节的数据sck上升沿写数据
uint8_t read_1302(uint8_t add);					 //读数据
void write_1302(uint8_t add,uint8_t dat);//向指定的寄存器写入一个字节的数据
void ds1302_init(void);									 //初始化1302
void ds1302_dataread(char *ttt);
u8 ds1302_settime(uint8_t *dat);
 
#endif

